curthenrichs/Undergrad-Embedded-Projects/CE4950 - Networking One/Workspace1/ce4950-term-project.cydsn/Generated_Source/PSoC5/CM_Test_RX_Pin.h
/*******************************************************************************
* File Name: CM_Test_RX_Pin.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_CM_Test_RX_Pin_H) /* CY_CONTROL_REG_CM_Test_RX_Pin_H */
#define CY_CONTROL_REG_CM_Test_RX_Pin_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} CM_Test_RX_Pin_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    CM_Test_RX_Pin_Write(uint8 control) ;
uint8   CM_Test_RX_Pin_Read(void) ;

void CM_Test_RX_Pin_SaveConfig(void) ;
void CM_Test_RX_Pin_RestoreConfig(void) ;
void CM_Test_RX_Pin_Sleep(void) ; 
void CM_Test_RX_Pin_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define CM_Test_RX_Pin_Control        (* (reg8 *) CM_Test_RX_Pin_Sync_ctrl_reg__CONTROL_REG )
#define CM_Test_RX_Pin_Control_PTR    (  (reg8 *) CM_Test_RX_Pin_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_CM_Test_RX_Pin_H */


/* [] END OF FILE */
